<h3 class="texto_modal">Entrada a la p&aacute;gina principal</h3>
<p class="texto_modal">El acceso se hace, sin necesidad de realizar autorizaci&oacute;n tipo usuario/contrase&ntilde;a ni OAuth, entrando en la direcci&oacute;n activa de escucha. Todas las operaciones se realizar&aacute;n sin necesidad de navegaci&oacute;n por p&aacute;ginas secundarias.</p>
<p class="texto_modal">&nbsp;</p>
<img class="imagen_modal img-fluid" src="TFMGuiaDeUso_archivos/image046.jpg">
<p class="texto_modal">Al entrar se pueden presentar dos escenarios:</p>
<ul>
<li class="li_modal">Primer acceso: se mostrar&aacute; un &aacute;rea de trabajo vac&iacute;a.</li>
<li class="li_modal">Acceso con trabajo previo: se mostrar&aacute;n los elementos cargados y el contenido del proyecto de una sesi&oacute;n previa del navegador.</li>
</ul>
<p class="texto_modal">Autom&aacute;ticamente, se considera que toda acci&oacute;n realizada formar&aacute; parte de un proyecto, y todos los cambios se guardar&aacute;n autom&aacute;ticamente.</p>
<h3 class="texto_modal">Importar v&iacute;deo o imagen</h3>
<p class="texto_modal">Para trabajar en un proyecto de anotaci&oacute;n, el primer paso es importar v&iacute;deos o im&aacute;genes. Para ello se puede hacer clic en el &aacute;rea de carga, que abrir&aacute; un di&aacute;logo para buscar los archivos, o se arrastrar&aacute;n a esta zona los archivos que se quieran usar.</p>
<p class="texto_modal">Es posible cargar m&aacute;s de un archivo a la vez. Los archivos que no sean de v&iacute;deo o imagen ser&aacute;n descartados, as&iacute; como los archivos ya subidos anteriormente.</p>
<p class="texto_modal">Los formatos de archivo con los que se puede trabajar son:</p>
<ul>
  <li class="li_modal">AVI</li>
  <li class="li_modal">MOV</li>
  <li class="li_modal">MP4</li>
  <li class="li_modal">MKV</li>
  <li class="li_modal">OGG</li>
  <li class="li_modal">WEBM</li>
  <li class="li_modal">JPG</li>
  <li class="li_modal">GIF</li>
  <li class="li_modal">PNG</li>
</ul>
<img class="imagen_modal" src="TFMGuiaDeUso_archivos/image047.jpg">
<p class="texto_modal">Los archivos son autom&aacute;ticamente almacenados en el servidor y preprocesados. Cuando est&eacute;n disponibles para su uso, aparecer&aacute;n en el &aacute;rea de recursos en forma de iconos: su color de fondo depende de si el archivo cargado es un v&iacute;deo o una imagen, y su anchura es proporcional a la duraci&oacute;n (a las im&aacute;genes se les da una duraci&oacute;n por defecto de 10 segundos):</p>
<p class="texto_modal"><img class="imagen_modal" src="TFMGuiaDeUso_archivos/image048.jpg"></p>
<p class="texto_modal">Pasando el rat&oacute;n por encima de cada elemento se puede ver una ventana emergente donde se puede ver la imagen en m&aacute;s tama&ntilde;o, adem&aacute;s del nombre del archivo y de su duraci&oacute;n (en caso de v&iacute;deo).</p>
<h3 class="texto_modal">Incluir un clip en un proyecto</h3>
<p class="texto_modal">Una vez cargados los archivos, se puede comenzar la creaci&oacute;n del v&iacute;deo a anotar arrastrando los iconos desde el &aacute;rea de recursos al &aacute;rea de edici&oacute;n. Cada recurso puede a&ntilde;adirse al &aacute;rea de edici&oacute;n tantas veces como se quiera.</p>
<p class="texto_modal"><img class="imagen_modal" src="TFMGuiaDeUso_archivos/image049.jpg">
<p class="texto_modal">En el &aacute;rea de edici&oacute;n es posible reordenar los clips arrastrando los iconos para colocarlos antes o despu&eacute;s de otro clip.</p>
<h3 class="texto_modal">Borrar un clip de un proyecto</h3>
<p class="texto_modal">Cuando queremos borrar un clip de un proyecto en curso, bastar&aacute; con seleccionarlo y arrastrarlo al &aacute;rea de papelera, situado justo debajo del &aacute;rea de edici&oacute;n. S&oacute;lo los clips que est&eacute;n en el &aacute;rea de edici&oacute;n pueden ser borrados, y s&oacute;lo se borrar&aacute; la copia que ha sido seleccionada.</p>
<p class="texto_modal"><img class="imagen_modal" src="TFMGuiaDeUso_archivos/image050.jpg"></p>
<p class="texto_modal">Los clips que hay a la derecha del clip eliminado se reordena para evitar dejar huecos en el v&iacute;deo final.</p>
<h3 class="texto_modal">Determinar rango de un v&iacute;deo</h3>
<p class="texto_modal">Es posible elegir qu&eacute; rango de un v&iacute;deo se quiere emplear en el proyecto final. Para ello, se har&aacute; clic en el icono correspondiente del &aacute;rea de edici&oacute;n; se abrir&aacute; una ventana emergente en la que aparecer&aacute; el v&iacute;deo en cuesti&oacute;n y una barra de desplazamiento con dos controles: uno para determinar el inicio y otro para determinar el fin del recorte de ese clip.</p>
<p class="texto_modal"><img class="imagen_modal" src="TFMGuiaDeUso_archivos/image051.jpg"></p>
<p class="texto_modal">Los cambios se aplican autom&aacute;ticamente. Para cerrar esta ventana, puede pulsarse la tecla <em>Escape</em> o hacer clic en el bot&oacute;n de marca que hay arriba a la derecha de la ventana emergente.</p>
<h3 class="texto_modal">Determinar rango de una imagen</h3>
<p class="texto_modal">Al igual que se hace con los v&iacute;deos, es posible elegir la duraci&oacute;n de una imagen en el resultado final. Se har&aacute; clic igualmente en el clip elegido, aunque para las im&aacute;genes aparecer&aacute; en la ventana emergente una barra con un s&oacute;lo punto de desplazamiento, que permitir&aacute; cambiar la duraci&oacute;n final de la imagen en un rango de entre uno y sesenta segundos:</p>
<p class="texto_modal"><img class="imagen_modal" src="TFMGuiaDeUso_archivos/image052.jpg"></p>
<p class="texto_modal">Al igual que con los clips de imagen, los cambios se aplican autom&aacute;ticamente y puede cerrarse la ventana haciendo clic en el bot&oacute;n de marca o pulsando la tecla <em>Escape</em>.</p>
<h3 class="texto_modal">Edici&oacute;n de notas con formato</h3>
<p class="texto_modal">Para acceder al editor de notas &shy;se debe hacer clic en el bot&oacute;n &ldquo;A&ntilde;adir Notas&rdquo; situado en la parte inferior derecha de la ventana. Se abrir&aacute; un recuadro emergente en el que se podr&aacute; ver la composici&oacute;n de clips y una barra de desplazamiento para seleccionar el punto de inicio de la nota.</p>
<p class="texto_modal"><img class="imagen_modal" src="TFMGuiaDeUso_archivos/image053.jpg"></p>
<p class="texto_modal">Para crear &shy;una nota se debe hacer clic con el rat&oacute;n sobre la posici&oacute;n donde se desea a&ntilde;adir la nota, considerando que se crear&aacute; a partir del momento seleccionado con la barra de desplazamiento (por ejemplo, en la imagen anterior las notas se crear&aacute;n a partir del segundo 81.86).</p>
<p class="texto_modal">Para editar una nota creada anteriormente bastar&aacute; con mover la barra de desplazamiento hasta un momento donde la nota sea visible, y hacer clic sobre ella para poder modificar sus atributos.</p>
<p class="texto_modal">Por defecto, cada nota permitir&aacute; a&ntilde;adir una l&iacute;nea de texto, en la que se pueden configurar:</p>
<ul>
<li class="li_modal">El tama&ntilde;o del texto, gracias a los botones <img class="imagen_modal_mini" src="TFMGuiaDeUso_archivos/image054.png">,
  <img class="imagen_modal_mini" src="TFMGuiaDeUso_archivos/image055.png"> y
  <img class="imagen_modal_mini" src="TFMGuiaDeUso_archivos/image056.png"> (H1 representa el mayor tama&ntilde;o, H3 el tama&ntilde;o por defecto).</li>
<li class="li_modal">Color del texto mediante el di&aacute;logo que aparece al seleccionar el bot&oacute;n 
  <img class="imagen_modal_mini" src="TFMGuiaDeUso_archivos/image069.png">. Para confirmar la selecci&oacute;n se deber&aacute; pulsar la tecla <em>Enter</em> tras elegir el color.</li>
<li class="li_modal">Estilo del texto, gracias a los botones 
  <img class="imagen_modal_mini" src="TFMGuiaDeUso_archivos/image057.png">(texto en negrita), 
  <img class="imagen_modal_mini" src="TFMGuiaDeUso_archivos/image058.png">(texto en cursiva) y al selector de fuentes que aparece al seleccionar 
  <img class="imagen_modal_mini" src="TFMGuiaDeUso_archivos/image059.png">.</li>
</ul>
<p class="texto_modal">Una nota de texto puede cambiarse a nota de imagen haciendo clic en 
  <img class="imagen_modal_mini" src="TFMGuiaDeUso_archivos/image060.png">; aparecer&aacute; un listado de <em>stickers</em> precargados en el sistema, as&iacute; como la lista de im&aacute;genes cargadas por el usuario en la zona de recursos. Tambi&eacute;n pulsando este bot&oacute;n se puede cambiar el tipo de imagen que se mostrar&aacute; en la nota.</p>
<p class="texto_modal">Es posible configurar la duraci&oacute;n de la nota, ya sea de imagen o de texto, mediante los siguientes botones:</p>
<ul>
<li class="li_modal"><img class="imagen_modal_mini" src="TFMGuiaDeUso_archivos/image061.png"> hace que la nota se muestre a partir del fotograma actual (si se est&aacute; editando una nota, se eliminar&aacute; de los fotogramas anteriores).</li>
<li class="li_modal"><img class="imagen_modal_mini" src="TFMGuiaDeUso_archivos/image062.png"> hace que la nota se muestre hasta el fotograma actual.</li>
<li class="li_modal"><img class="imagen_modal_mini" src="TFMGuiaDeUso_archivos/image063.png"> expande la nota de principio a fin del v&iacute;deo.</li>
</ul>
<p class="texto_modal">S&oacute;lo se mostrar&aacute;n en el &aacute;rea de edici&oacute;n aquellas notas visibles en el momento elegido en la barra de desplazamiento (por ejemplo, si una nota s&oacute;lo es visible a partir del segundo 10, mover la barra de desplazamiento al segundo 5 har&aacute; que la nota no sea visible).</p>
<p class="texto_modal">La visibilidad de los dos tipos de nota se puede modificar mediante las siguientes acciones, que afectan a toda la duraci&oacute;n de la nota.</p>
<ul>
<li class="li_modal">Es posible mover la nota libremente mediante el uso de 
  <img class="imagen_modal_mini" src="TFMGuiaDeUso_archivos/image064.png">. La nota aparecer&aacute; en ese punto durante toda su duraci&oacute;n.</li>
<li class="li_modal">Con 
  <img class="imagen_modal_mini" src="TFMGuiaDeUso_archivos/image065.png"> se puede posicionar una nota detr&aacute;s de otra nota, independientemente de si es texto o imagen. Por otro lado, con 
  <img class="imagen_modal_mini" src="TFMGuiaDeUso_archivos/image066.png"> se har&aacute; que la nota seleccionada se acerque y se ponga sobre otras notas:</li>
</ul>
<p class="texto_modal"><img class="imagen_modal" src="TFMGuiaDeUso_archivos/image067.jpg"></p>
<ul>
<li class="li_modal"><img class="imagen_modal_mini" src="TFMGuiaDeUso_archivos/image068.png"> elimina la nota completamente.</li>
</ul>
<p class="texto_modal">No hay l&iacute;mite de notas por proyecto.</p>
<h3 class="texto_modal">Generaci&oacute;n de v&iacute;deo</h3>
<p class="texto_modal">Una vez ordenados los clips en la zona de edici&oacute;n y, opcionalmente, incluidas las notas deseadas, bastar&aacute; con hacer clic en el bot&oacute;n &ldquo;Generar v&iacute;deo&rdquo;, situado abajo a la derecha, para que se comience con la creaci&oacute;n del v&iacute;deo. Se mostrar&aacute; una barra de progreso seg&uacute;n se vayan completando los diferentes pasos, hasta que el v&iacute;deo est&eacute; completo y se descargue en el navegador en formato mp4.</p>
<p class="texto_modal">Las im&aacute;genes y v&iacute;deos que no tengan una proporci&oacute;n de 16/9 ser&aacute;n redimensionados autom&aacute;ticamente para encajar en el v&iacute;deo final.</p>
<p class="texto_modal">Durante el proceso de creación del vídeo, será posible cancelar la operación en cualquier momento haciendo clic en el botón de la zona inferior.</p>
<p class="texto_modal"><img class="imagen_modal " src="TFMGuiaDeUso_archivos/Screenshot_2.png"></p>
<h3 class="texto_modal">Acciones adicionales</h3>
<p class="texto_modal">La p&aacute;gina ofrece una serie de ayudas contextuales, identificadas por el s&iacute;mbolo de interrogaci&oacute;n, en diferentes secciones. Haciendo clic en estas ayudas se accede a unos textos que explican brevemente el funcionamiento de cada pantalla.</p>
<p class="texto_modal">Por otro lado, haciendo clic en el bot&oacute;n &ldquo;Borra proyecto&rdquo; se eliminar&aacute;n todos los archivos del proyecto, tanto en el cliente como en el servidor, as&iacute; como las notas creadas. De esta manera se puede comenzar de nuevo con la carga de im&aacute;genes y v&iacute;deos.</p>
<p/>